; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	thermograph2 - mode
	image0 - mode
	image3 - mode
	image1 - mode
	Star2 - direction
	Star7 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star6 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument2 image0)
	(supports instrument2 thermograph2)
	(supports instrument2 image3)
	(calibration_target instrument2 Star7)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 thermograph2)
	(supports instrument4 image0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument5 image1)
	(supports instrument5 thermograph2)
	(supports instrument5 image3)
	(calibration_target instrument5 Star6)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument6 image0)
	(supports instrument6 thermograph2)
	(supports instrument6 image3)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
)
(:goal (and
	(have_image Phenomenon8 image0)
	(have_image Star9 image1)
	(have_image Phenomenon10 image1)
	(have_image Phenomenon11 thermograph2)
	(have_image Star12 image1)
	(have_image Star13 image3)
	(have_image Phenomenon14 image1)
	(have_image Star15 thermograph2)
))

)

; plan
1. (turn_to satellite1 star7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star7)
   goals met: 0 of 8
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 8
3. (calibrate satellite1 instrument2 star7)
   added: (calibrated instrument2)
   goals met: 0 of 8
4. (turn_to satellite1 star13 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star13)
   goals met: 0 of 8
5. (take_image satellite1 star13 instrument2 image3)
   added: (have_image star13 image3)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon8 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 phenomenon8)
   goals met: 1 of 8
7. (take_image satellite1 phenomenon8 instrument2 image0)
   added: (have_image phenomenon8 image0)
   goals met: 2 of 8
8. (turn_to satellite1 phenomenon11 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 8
9. (turn_to satellite0 groundstation4 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation4)
   goals met: 2 of 8
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
11. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 2 of 8
12. (take_image satellite1 phenomenon11 instrument2 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 3 of 8
13. (turn_to satellite0 phenomenon10 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 8
14. (take_image satellite0 phenomenon10 instrument0 image1)
   added: (have_image phenomenon10 image1)
   goals met: 4 of 8
15. (turn_to satellite0 phenomenon14 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon14)
   goals met: 4 of 8
16. (take_image satellite0 phenomenon14 instrument0 image1)
   added: (have_image phenomenon14 image1)
   goals met: 5 of 8
17. (turn_to satellite0 star12 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star12)
   goals met: 5 of 8
18. (take_image satellite0 star12 instrument0 image1)
   added: (have_image star12 image1)
   goals met: 6 of 8
19. (turn_to satellite0 star15 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star15)
   goals met: 6 of 8
20. (take_image satellite0 star15 instrument0 thermograph2)
   added: (have_image star15 thermograph2)
   goals met: 7 of 8
21. (turn_to satellite0 star9 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star9)
   goals met: 7 of 8
22. (take_image satellite0 star9 instrument0 image1)
   added: (have_image star9 image1)
   goals met: 8 of 8
